[
  {
    id: 1,
    title: 'ミッション：インポッシブル/ローグ・ネイション',
    description: '超敏腕スパイ：イーサン・ハント率いるIMFは無国籍スパイ「シンジケート」の暗躍により、またしても解体の窮地に追い込まれてしまう。イーサンはこの最強の敵にどう立ち向かうのか？誰が敵か味方かわからない中、究極の諜報バトルが繰り広げられる。史上最難関のミッションをコンプリートできるのか！？イーサンの究極の「作戦」とは？',
    screening_time: 131,
    screening_date: '2015-08-07',
    thumbnail_url: 'https://d2ueuvlup6lbue.cloudfront.net/attachments/7566ff53749e3d6995d1eb21af78eccd2217b29e/store/fitpad/260/364/602643410621dccb9cac41f90c5fa0c50956c53e2b32558e94adfa3310fa/_.jpg',
  },
  {
    id: 2,
    title: 'キングスマン',
    description: 'ロンドンの高級テーラー「キングスマン」。しかしその実体は、どこの国にも属さない世界最強のスパイ機関だった！高級テーラー「キングスマン」。その裏の顔は世界最強のスパイ機関である。ブリティッシュ・スーツをスタイリッシュに着こなすハリー（コリン・ファース）は、そのエリートスパイ。組織の指揮者アーサー（マイケル・ケイン）の指令で、何者かに惨殺されたエージェントの代わりに新人をスカウトすることに。ハリーは街の若者エグジー（タロン・エガートン）に可能性を見出し、「キングスマン」の候補生に抜擢。実はハリーは、死んだエグジーの父と旧知の仲で、ある約束を果たそうとしていたのだった。一方で、頻発する科学者失踪事件の首謀者でＩＴ富豪のヴァレンタイン（サミュエル・Ｌ・ジャクソン）が、前代未聞の人類抹殺計画を進めていた。調査を開始した「キングスマン」にも、ヴァレンタインの魔の手が迫る。果たして、エグジーはキングスマンの一員となれるのか。そして、「キングスマン」はテロを阻止できるのか。世界最強のスパイ機関、ついに出動！',
    screening_time: 129,
    screening_date: '2015-09-11',
    thumbnail_url: 'httpshttps://d2ueuvlup6lbue.cloudfront.net/attachments/bf3808dbf115af1b6651fd0fcc46a1785cfd6876/store/fitpad/260/364/19fa193e930a04eacac31e073424d863e11bee869835adb4ac109eeecde6/_.jpg',
  },
  {
    id: 3,
    title: 'シャイニング',
    description: '冬の間閉鎖されるホテルに、作家志望のジャック一家が管理人としてやってきた。そのホテルでは過去に、管理人が家族を惨殺するという事件が起こっていたのだが…。',
    screening_time: 119,
    screening_date: '1980-12-13',
    thumbnail_url: 'https://d2ueuvlup6lbue.cloudfront.net/attachments/8b8fde9f5221f1191a6794f6c3edad60e845b485/store/fitpad/260/364/349e6dcf4f44d02b6616b8f76a1d508d7431ed40ac1c58fb33ae7b162272/_.jpg',
  },
  {
    id: 2,
    title: 'キングスマン',
    description: 'ロンドンの高級テーラー「キングスマン」。しかしその実体は、どこの国にも属さない世界最強のスパイ機関だった！高級テーラー「キングスマン」。その裏の顔は世界最強のスパイ機関である。ブリティッシュ・スーツをスタイリッシュに着こなすハリー（コリン・ファース）は、そのエリートスパイ。組織の指揮者アーサー（マイケル・ケイン）の指令で、何者かに惨殺されたエージェントの代わりに新人をスカウトすることに。ハリーは街の若者エグジー（タロン・エガートン）に可能性を見出し、「キングスマン」の候補生に抜擢。実はハリーは、死んだエグジーの父と旧知の仲で、ある約束を果たそうとしていたのだった。一方で、頻発する科学者失踪事件の首謀者でＩＴ富豪のヴァレンタイン（サミュエル・Ｌ・ジャクソン）が、前代未聞の人類抹殺計画を進めていた。調査を開始した「キングスマン」にも、ヴァレンタインの魔の手が迫る。果たして、エグジーはキングスマンの一員となれるのか。そして、「キングスマン」はテロを阻止できるのか。世界最強のスパイ機関、ついに出動！',
    screening_time: 129,
    screening_date: '2015-09-11',
    thumbnail_url: 'httpshttps://d2ueuvlup6lbue.cloudfront.net/attachments/bf3808dbf115af1b6651fd0fcc46a1785cfd6876/store/fitpad/260/364/19fa193e930a04eacac31e073424d863e11bee869835adb4ac109eeecde6/_.jpg',
  },
  {
    id: 2,
    title: 'キングスマン',
    description: 'ロンドンの高級テーラー「キングスマン」。しかしその実体は、どこの国にも属さない世界最強のスパイ機関だった！高級テーラー「キングスマン」。その裏の顔は世界最強のスパイ機関である。ブリティッシュ・スーツをスタイリッシュに着こなすハリー（コリン・ファース）は、そのエリートスパイ。組織の指揮者アーサー（マイケル・ケイン）の指令で、何者かに惨殺されたエージェントの代わりに新人をスカウトすることに。ハリーは街の若者エグジー（タロン・エガートン）に可能性を見出し、「キングスマン」の候補生に抜擢。実はハリーは、死んだエグジーの父と旧知の仲で、ある約束を果たそうとしていたのだった。一方で、頻発する科学者失踪事件の首謀者でＩＴ富豪のヴァレンタイン（サミュエル・Ｌ・ジャクソン）が、前代未聞の人類抹殺計画を進めていた。調査を開始した「キングスマン」にも、ヴァレンタインの魔の手が迫る。果たして、エグジーはキングスマンの一員となれるのか。そして、「キングスマン」はテロを阻止できるのか。世界最強のスパイ機関、ついに出動！',
    screening_time: 129,
    screening_date: '2015-09-11',
    thumbnail_url: 'httpshttps://d2ueuvlup6lbue.cloudfront.net/attachments/bf3808dbf115af1b6651fd0fcc46a1785cfd6876/store/fitpad/260/364/19fa193e930a04eacac31e073424d863e11bee869835adb4ac109eeecde6/_.jpg',
  },
  {
    id: 2,
    title: 'キングスマン',
    description: 'ロンドンの高級テーラー「キングスマン」。しかしその実体は、どこの国にも属さない世界最強のスパイ機関だった！高級テーラー「キングスマン」。その裏の顔は世界最強のスパイ機関である。ブリティッシュ・スーツをスタイリッシュに着こなすハリー（コリン・ファース）は、そのエリートスパイ。組織の指揮者アーサー（マイケル・ケイン）の指令で、何者かに惨殺されたエージェントの代わりに新人をスカウトすることに。ハリーは街の若者エグジー（タロン・エガートン）に可能性を見出し、「キングスマン」の候��生に抜擢。実はハリーは、死んだエグジーの父と旧知の仲で、ある約束を果たそうとしていたのだった。一方で、頻発する科学者失踪事件の首謀者でＩＴ富豪のヴァレンタイン（サミュエル・Ｌ・ジャクソン）が、前代未聞の人類抹殺計画を進めていた。調査を開始した「キングスマン」にも、ヴァレンタインの魔の手が迫る。果たして、エグジーはキングスマンの一員となれるのか。そして、「キングスマン」はテロを阻止できるのか。世界最強のスパイ機関、ついに出動！',
    screening_time: 129,
    screening_date: '2015-09-11',
    thumbnail_url: 'httpshttps://d2ueuvlup6lbue.cloudfront.net/attachments/bf3808dbf115af1b6651fd0fcc46a1785cfd6876/store/fitpad/260/364/19fa193e930a04eacac31e073424d863e11bee869835adb4ac109eeecde6/_.jpg',
  },
  {
    id: 2,
    title: 'キングスマン',
    description: 'ロンドンの高級テーラー「キングスマン」。しかしその実体は、どこの国にも属さない世界最強のスパイ機関だった！高級テーラー「キングスマン」。その裏の顔は世界最強のスパイ機関である。ブリティッシュ・スーツをスタイリッシュに着こなすハリー（コリン・ファース）は、そのエリートスパイ。組織の指揮者アーサー（マイケル・ケイン）の指令で、何者かに惨殺されたエージェントの代わりに新人をスカウトすることに。ハリーは街の若者エグジー（タロン・エガートン）に可能性を見出し、「キングスマン」の候補生に抜擢。実はハリーは、死んだエグジーの父と旧知の仲で、ある約束を果たそうとしていたのだった。一方で、頻発する科学者失踪事件の首謀者でＩＴ富豪のヴァレンタイン（サミュエル・Ｌ・ジャクソン）が、前代未聞の人類抹殺計画を進めていた。調査を開始した「キングスマン」にも、ヴァレンタインの魔の手が迫る。果たして、エグジーはキングスマンの一員となれるのか。そして、「キングスマン」はテロを阻止できるのか。世界最強のスパイ機関、ついに出動！',
    screening_time: 129,
    screening_date: '2015-09-11',
    thumbnail_url: 'httpshttps://d2ueuvlup6lbue.cloudfront.net/attachments/bf3808dbf115af1b6651fd0fcc46a1785cfd6876/store/fitpad/260/364/19fa193e930a04eacac31e073424d863e11bee869835adb4ac109eeecde6/_.jpg',
  },
  {
    id: 2,
    title: 'キングスマン',
    description: 'ロンドンの高級テーラー「キングスマン」。しかしその実体は、どこの国にも属さない世界最強のスパイ機関だった！高級テーラー「キングスマン」。その裏の顔は世界最強のスパイ機関である。ブリティッシュ・スーツをスタイリッシュに着こなすハリー（コリン・ファース）は、そのエリートスパイ。組織の指揮者アーサー（マイケル・ケイン）の指令で、何者かに惨殺されたエージェントの代わりに新人をスカウトすることに。ハリーは街の若者エグジー（タロン・エガートン）に可能性を見出し、「キングスマン」の候補生に抜擢。実はハリーは、死んだエグジーの父と旧知の仲で、ある約束を果たそうとしていたのだった。一方で、頻発する科学者失踪事件の首謀者でＩＴ富豪のヴァレンタイン（サミュエル・Ｌ・ジャクソン）が、前代未聞の人類抹殺計画を進めていた。調査を開始した「キングスマン」にも、ヴァレンタインの魔の手が迫る。果たして、エグジーはキングスマンの一員となれるのか。そして、「キングスマン」はテロを阻止できるのか。世界最強のスパイ機関、ついに出動！',
    screening_time: 129,
    screening_date: '2015-09-11',
    thumbnail_url: 'httpshttps://d2ueuvlup6lbue.cloudfront.net/attachments/bf3808dbf115af1b6651fd0fcc46a1785cfd6876/store/fitpad/260/364/19fa193e930a04eacac31e073424d863e11bee869835adb4ac109eeecde6/_.jpg',
  },
  {
    id: 2,
    title: 'キングスマン',
    description: 'ロンドンの高級テーラー「キングスマン」。しかしその実体は、どこの国にも属さない世界最強のスパイ機関だった！高級テーラー「キングスマン」。その裏の顔は世界最強のスパイ機関である。ブリティッシュ・スーツをスタイリッシュに着こなすハリー（コリン・ファース）は、そのエリートスパイ。組織の指揮者アーサー（マイケル・ケイン）の指令で、何者かに惨殺されたエージェントの代わりに新人をスカウトすることに。ハリーは街の若者エグジー（タロン・エガートン）に可能性を見出し、「キングスマン」の候補生に抜擢。実はハリーは、死んだエグジーの父と旧知の仲で、ある約束を果たそうとしていたのだった。一方で、頻発する科学者失踪事件の首謀者でＩＴ富豪のヴァレンタイン（サミュエル・Ｌ・ジャクソン）が、前代未聞の人類抹殺計画を進めていた。調査を開始した「キングスマン」にも、ヴァレンタインの魔の手が迫る。果たして、エグジーはキングスマンの一員となれるのか。そして、「キングスマン」はテロを阻止できるのか。世界最強のスパイ機関、ついに出動！',
    screening_time: 129,
    screening_date: '2015-09-11',
    thumbnail_url: 'httpshttps://d2ueuvlup6lbue.cloudfront.net/attachments/bf3808dbf115af1b6651fd0fcc46a1785cfd6876/store/fitpad/260/364/19fa193e930a04eacac31e073424d863e11bee869835adb4ac109eeecde6/_.jpg',
  },
  {
    id: 2,
    title: 'キングスマン',
    description: 'ロンドンの高級テーラー「キングスマン」。しかしその実体は、どこの国にも属さない世界最強のスパイ機関だった！高級テーラー「キングスマン」。その裏の顔は世界最強のスパイ機関である。ブリティッシュ・スーツをスタイリッシュに着こなすハリー（コリン・ファース）は、そのエリートスパイ。組織の指揮者アーサー（マイケル・ケイン）の指令で、何者かに惨殺されたエージェントの代わりに新人をスカウトすることに。ハリーは街の若者エグジー（タロン・エガートン）に可能性を見出し、「キングスマン」の候補生に抜擢。実はハリーは、死んだエグジーの父と旧知の仲で、ある約束を果たそうとしていたのだった。一方で、頻発する科学者失踪事件の首謀者でＩＴ富豪のヴァレンタイン（サミュエル・Ｌ・ジャクソン）が、前代未聞の人類抹殺計画を進めていた。調査を開始した「キングスマン」にも、ヴァレンタインの魔の手が迫る。果たして、エグジーはキングスマンの一員となれるのか。そして、「キングスマン」はテロを阻止できるのか。世界最強のスパイ機関、ついに出動！',
    screening_time: 129,
    screening_date: '2015-09-11',
    thumbnail_url: 'httpshttps://d2ueuvlup6lbue.cloudfront.net/attachments/bf3808dbf115af1b6651fd0fcc46a1785cfd6876/store/fitpad/260/364/19fa193e930a04eacac31e073424d863e11bee869835adb4ac109eeecde6/_.jpg',
  },
].each do |data|
  movie = Movie.find_or_initialize_by(id: data[:id])
  movie.title = data[:title]
  movie.description = data[:description]
  movie.screening_time = data[:screening_time]
  movie.screening_date = data[:screening_date]
  movie.thumbnail_url = data[:thumbnail_url]
  movie.save!
end